[{"id": "activity:7068256811098804224", "urn": "urn:li:activity:7068256811098804224", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7068256811098804224", "author": "ACEINNA", "timeFormatted": "1mo", "content": {"type": "article", "source": "https://www.powersystemsdesign.com/articles/enhancing-motor-performance-in-demanding-systems-with-advanced-current-sensing/22/19989", "title": "Enhancing Motor Performance in Demanding Systems with Advanced Current Sensing", "thumbnail": {"width": 198, "height": 205, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-7bb9e434f1.jpeg"}}, "text": "How to use advanced current sensing to enhance motor performance in demanding systems? \n\nA growing number of motorized consumer products, industrial systems, and vehicles are being fielded today.  Market expectations demand the highest levels of performance     \n\nRead this Power Systems Design Magazine article here - https://lnkd.in/gzZMQdzB  \n\n#currentsensor #motorperformance #motordesign #powersupplydesign #electricvehicles "}, {"id": "activity:7059931899359604738", "urn": "urn:li:activity:7059931899359604738", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7059931899359604738", "author": "ACEINNA", "timeFormatted": "1mo", "content": {"type": "article", "source": "https://www.oemoffhighway.com/electronics/smart-systems/automated-systems/article/22860706/te-connectivity-industrial-commercial-transportation-business-unit-with-promises-of-improved-safety-efficiency-and-sustainability-autonomy-is-the-future-of-offhighway-equipment", "title": "With Promises of Improved Safety, Efficiency and Sustainability, Autonomy Is the Future of Off-Highway Equipment", "thumbnail": {"width": 800, "height": 522, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-6e9d427704.jpeg"}}, "text": "Why is Autonomy Is the Future of Off-Highway Equipment?\n\nCommercial vehicle autonomy is here to stay. Manufacturers who are not actively working on this technology risk watching their competitors’ autonomous vehicles leave them in the dust.\n\n#autonomousvehicles #autonomousfuture #agriculturaltechnology #agtech #constructiontechnology #offroad #technology #future \n\n\n\nRead the entire article at OEM Off Highway Magazine - https://lnkd.in/gQYr6R6C\n"}, {"id": "activity:7059147278527172608", "urn": "urn:li:activity:7059147278527172608", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7059147278527172608", "author": "ACEINNA", "timeFormatted": "1mo", "content": {"type": "article", "source": "https://www.bisinfotech.com/electric-vehicle-warning-sound-system", "title": "Electric Vehicle Warning Sound System", "thumbnail": {"width": 415, "height": 240, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-ca9d64e83e.jpeg"}}, "text": "How is the automotive industry trying to solve the silent EV and Hybrid car problem? All about Electric Vehicle Warning Sound Systems\n\nTraditional combustion engine vehicles emit engine sound, even at low travel speeds. Typically, pedestrians and other traffic participants recognize an approaching or departing vehicle through sight and auditory identification of tire sounds and other emitted noise when the vehicle is out of sight.\n\nElectric vehicles (EVs) do not emit engine sound. Hybrid electric vehicles (HEVs) or plug-in hybrid electric vehicles (PHEVs) move almost silently when traveling at low speeds and before the conventional internal combustion engine (ICE) kicks in. These vehicles are difficult to hear when travelling at speeds less than 19 mph.\n\nAt greater speeds, tire sound becomes dominant.\n\nGlobal governing bodies are exploring legislation that seeks to establish a minimum level of sound for PHEVs and HEVs when operating in electric mode so that visually impaired people, pedestrians, and cyclists can hear these vehicles approach and determine from which direction these vehicles are approaching.An example of this legislation can be found on the National Highway Traffic Safety Administration (NHTSA) website.\n\nAn electric vehicle warning sound system (EVWSS) produces a series of sounds designed to alert pedestrians to the presence of EVs, HEVs, and PHEVs. The driver can initiate warning sounds (similar to the sound from a car horn, but less urgent); however, the sounds must automatically be enabled at low speeds.These sounds vary from artificial tones to realistic sounds that mimic engine noise and tires moving over gravel.\n\nRead the entire article here - https://lnkd.in/gtFRrGnh\n\n#travel #electricvehicles #safety #electricvehicle #pedestriansafety #automotiveindustry #EVWSS"}, {"id": "activity:7058808786374799360", "urn": "urn:li:activity:7058808786374799360", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7058808786374799360", "author": "ACEINNA", "timeFormatted": "1mo", "content": {"type": "image", "source": null, "title": null, "thumbnail": {"width": 609, "height": 866, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-f704b8dabc.jpeg"}}, "text": "ACEINNA's new IMU330RA Inertial Measurement Unit (IMU) sensor named as an Electronic Design Magazine Product of the Week\n\nhttps://lnkd.in/e5ThMzDx\n \nAutomotive-Grade IMU Outputs Over Ethernet, CAN-FD\nACEINNA recently released a high-performance, automotive-grade IMU for semi-autonomous cars. The six-degrees-of-freedom (6-DOF) sensor module, dubbed the IMU330RA, comes in a rugged, sealed over-molded IP69K plastic housing that’s easy to integrate in existing systems.\n\nThe IMU incorporates a redundant three-axis accelerometer and three-axis gyroscope sensors for additional accuracy and reliability. The IMU330RA is rated ASIL B, but it can serve as the basis for building positioning systems with up to ASIL D ratings. The operating temperature range is −40 to 105°C. Precision timing and diagnostics are supported as well.\n\nThe sensor module outputs at up to 1000 Hz to 1000Base-T1 Ethernet and CAN-FD interfaces while keeping latency in check. Other features of the fully temperature calibrated IMU include encrypted software updates and communication with an onboard hardware security module (HSM).\n\nIMUs are a key building block in navigation and safety systems in cars. These sensors work with many different perception sensors around the vehicle, including LiDAR, cameras, and radar to keep the vehicle driving on the correct path. #IMU #autonomousvehicles #autonomousfuture #design #safety #automotive #cars #selfdrivingcars #hardware #software "}, {"id": "activity:7058793922839384064", "urn": "urn:li:activity:7058793922839384064", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7058793922839384064", "author": "ACEINNA", "timeFormatted": "1mo", "content": {"type": "image", "source": null, "title": null, "thumbnail": {"width": 721, "height": 838, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-69149a2f2c.jpeg"}}, "text": "What do engineers need to know about using Advanced Current Sensing to Enhance Motor Performance?\n\nEnhancing Motor Performance in Demanding Systems with Advanced Current Sensing\n\nPage 47 at https://lnkd.in/gA32hfQC \n \nA growing number of motorized consumer products, industrial systems, and vehicles are being fielded today, and market expectations demand the highest levels of performance\n \n5 pages in the print and online print edition\n \nOne of the best ways to address motor control circuit optimization is with advanced current-sensing solutions.\n \nWe live in a time of disruptive growth, as new technologies are both benefiting and challenging society, with advances ranging\nfrom alternate energy systems to wide-bandgap semiconductors.\n\nOne aspect of our increasingly more technological society is the\ngrowing proliferation of powered systems, like electric bicycles,\ncars, and buses. The demand for economy, efficiency, power, and\nfunctionality is placing a great deal of pressure on the engineering\ncommunity to address theseneeds. Read the entire article here  https://lnkd.in/gA32hfQC\n\n#currentsensor #currentsensing #Motorcontrol #engineering #energy #power #cars #powerconversion "}, {"id": "activity:7056615109959319552", "urn": "urn:li:activity:7056615109959319552", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7056615109959319552", "author": "ACEINNA", "timeFormatted": "2mo", "content": {"type": "article", "source": "https://www.teslarati.com/storedot-vinfast-partner-develop-worlds-fastest-charging-ev-battery/", "title": "StoreDot and VinFast partner to develop world's fastest-charging EV battery", "thumbnail": {"width": 800, "height": 450, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-869c062d36.jpeg"}}, "text": "Vinfast and StoreDot are partnering to develop world’s fastest-charging EV battery\n\nIn a unique collaboration that will attempt to abolish long wait times for EV charging, StoreDot and VinFast have agreed to partner in developing the world’s fastest-charging electric vehicle battery.\n\nStoreDot is an Israeli company specializing in the early-stage development of extreme fast-charging (XFC) battery cells that are set to rival some of the biggest names in the industry. Meanwhile, VinFast is a Vietnamese company building next-generation electric cars, making the two companies an obvious partnership candidate to solve EV charging problems.\n\nOne of the most significant issues in EV charging is wait times, and StoreDot may have found the solution. Over the past few years, the company has built prototypes and samples of XFC cells that will offer as much as 100 miles of range in as little as two minutes.\n\nIt currently has three generations of samples – 100in5, 100in3, and 100in2- all of which utilize silicon-dominant XFC, semi-solid state, and post-lithium architecture.  \n\nRead the article here https://lnkd.in/djVmedkR\n#electriccars #batterytechnology #evbatteries #evcharginginfrastructure #Vinfast #technologysolutions #cars #electricvehicle "}, {"id": "activity:7056247754754326528", "urn": "urn:li:activity:7056247754754326528", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7056247754754326528", "author": "ACEINNA", "timeFormatted": "2mo", "content": {"type": "article", "source": "https://electronicsera.in/state-of-autonomous-vehicles-in-india-current-progress-and-future-outlook/", "title": "State of Autonomous Vehicles in India: Current Progress and Future Outlook", "thumbnail": {"width": 533, "height": 300, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-4706a045c4.jpeg"}}, "text": "What is the State of Autonomous Vehicles in India?  Current Progress and Future Outlook\n\nWhat are the Challenges for Autonomous Vehicles in India\n\nWhile the development of AVs is progressing rapidly around the world, there are unique challenges that need to be addressed before they can become a reality in India. Here are few challenges:\n\nInfrastructure: Major challenge is the country’s intracity road infrastructure. Many roads especially state owned are poorly maintained, and there is a lack of proper signage and road markings. This can make it difficult for AVs to navigate and make decisions about how to respond to their environment. Additionally, there may be challenges related to poor lighting and road congestion, which can make it difficult for autonomous vehicles to operate safely and efficiently.\n\nDriving Behaviour: Indian driving culture is known for its unpredictability and the tendency of drivers to ignore traffic laws. This poses a challenge for AVs that rely on consistent and predictable behaviour from other drivers on the road. Furthermore, AVs need to be programmed to understand the driving behaviours of Indian motorists, which can be difficult to do given the wide range of behaviours that can be observed on Indian roads.\n\nTechnology: The development of AVs requires advanced technology, such as sensors, cameras, and computer systems, which can be expensive and difficult to maintain. This may limit the adoption of AVs, particularly among low-income populations.\n\nRule-Regulation: Implementation of AVs in India is the need for a comprehensive legal and regulatory framework. India’s current laws and regulations are not designed to handle the complexities of autonomous vehicles, and there is a need for new policies that can govern the use of this technology on Indian roads.\n\nAccident Liability: The key consideration with AVs is determining accident liability. Who should be held accountable for accidents caused by self-driving vehicles? With the software driving the vehicle and making all critical decisions, liability becomes complicated. While early AVs design had a person behind the steering wheel, newer models like those developed by Google lack any physical controls, such as a dashboard or steering wheel. In these designs, passengers have no means of controlling the vehicle in the event of an emergency. Moreover, because passengers are likely to be in a relaxed state and not paying close attention to the road, they may not be prepared to take action if needed. By the time they do realize the need to act, it may already be too late to prevent a collision.\n\nRead the entire article here https://lnkd.in/g4-4gvKv\n#autonomousfuture #autonomousvehicles #automotiveindustry #India #culture #technology #infrastructure "}, {"id": "activity:7054166606196736002", "urn": "urn:li:activity:7054166606196736002", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7054166606196736002", "author": "ACEINNA", "timeFormatted": "2mo", "content": {"type": "article", "source": "https://roboticsandautomationnews.com/2023/04/06/safety-features-of-self-driving-cars/66500/", "title": "Safety Features of Self-Driving Cars", "thumbnail": {"width": 750, "height": 500, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-92a80cbe2e.jpeg"}}, "text": "What are the Critical Automotive Safety Features of Self-Driving Cars and ADAS?\n\nThis is a great list....\n\nSelf-driving cars are one of the most revolutionary technological advancements of our time. As with any new technology, safety is paramount for these vehicles. To ensure the safety of their passengers and those around them, self-driving cars have various features designed to keep everyone safe.\n\nWith advances in technology, self-driving cars will be safer than human operated vehicles. In the US, 30,000 lives are lost each year in motor vehicle accidents, often due to fatigue, human error, and drunk driving.\nAutonomous vehicles function without these behaviors, potentially saving thousands of lives. Here is a look at some of the advanced safety features of self-driving vehicles.\n\nRead the entire article at Robotics & Automation magazine https://lnkd.in/gAbndxdK\n\n#automotiveindustry #autonomousvehicles #autonomousfuture #ADAS #automotivesafety #robotics #automation #safety #technology "}, {"id": "activity:7054068920084795392", "urn": "urn:li:activity:7054068920084795392", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7054068920084795392", "author": "ACEINNA", "timeFormatted": "2mo", "content": {"type": "article", "source": "https://www.batterytechonline.com/design-and-manufacturing/ev-makers-look-new-battery-tech-extended-range", "title": "EV Makers Look to New Battery Tech for Extended Range", "thumbnail": {"width": 800, "height": 415, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-7bd302e847.jpeg"}}, "text": "New Electric Vehicle Battery Technologies for Extended Range\n\nMercedes, Tesla, and Ford are the latest to put new battery chemistries under the hood.\n\nElectric vehicle (EV) makers are facing increasing pressure to develop innovative battery technologies to power their vehicles. The global transition towards electrification has led to a surge in demand for EVs, and battery technology is at the forefront of this growth. While lithium-ion batteries have been the go-to power source for EVs for several years, concerns about their sustainability, safety, and limitations in terms of energy density have prompted EV makers to look towards novel battery technologies.\n\nNew battery technologies such as solid-state batteries, lithium-sulfur batteries, and metal-air batteries are gaining attention due to their potential to overcome the limitations of lithium-ion batteries. Solid-state batteries, for example, offer higher energy density, faster charging times, and greater safety compared to traditional lithium-ion batteries. Lithium-sulfur batteries, on the other hand, have the potential to offer even higher energy densities, while metal-air batteries could provide extended driving ranges for EVs.\n\nRead the entire article at Battery Technology Magazine  https://lnkd.in/g2zVejgA\n#tesla #energy #electriccars #electricvehicles #evbatteries #evcharginginfrastructure #batteries #technology #power #electricvehicle "}, {"id": "activity:7053818989210189824", "urn": "urn:li:activity:7053818989210189824", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7053818989210189824", "author": "ACEINNA", "timeFormatted": "2mo", "content": {"type": "article", "source": "https://jalopnik.com/autonomous-vehicles-need-to-learn-about-road-rage-1850343865", "title": "Autonomous Vehicles Need to Learn How to Deal with Aggressive Drivers", "thumbnail": {"width": 800, "height": 450, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-83b0d0cf52.jpeg"}}, "text": "Autonomous Vehicles Need to Learn How to Deal with Aggressive Drivers\n\nHumans can identify angry, stressed-out motorists easily. Computers, not so much.\n\nHow do you teach road rage to a robot?\n\nYou’ve likely seen it on the highway — a car that’s tailgating, darting between lanes, passing in the shoulder. You, a (presumably) human person, understand what that means: An irritated driver is behind the wheel. As autonomous vehicle development continues, those cars will eventually need to learn how to respond to that same situation. But, how do you teach road rage to a robot?\n\nhttps://lnkd.in/geFHN-Gb\n\n#autonomousfuture #automotiveindustry #autonomousvehicles #selfdrivingcars #robotics #IMU\n"}, {"id": "activity:7052715148414767104", "urn": "urn:li:activity:7052715148414767104", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7052715148414767104", "author": "ACEINNA", "timeFormatted": "2mo", "content": {"type": "article", "source": "https://www.marketwatch.com/press-release/6-axis-imu-market-size-by-2030-2023-04-08", "title": "6-Axis IMU Market Size By 2030", "thumbnail": {"width": 800, "height": 420, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-d446a8a615.jpeg"}}, "text": "6-Axis IMU Market Size By 2030\n\nAceinna is one of the key players in this space\n\n The latest market research report on the Global \"6-Axis IMU Market\" is segmented by Regions, Country, Company and other Segments. The global 6-Axis IMU market is dominated by key Players, such as [InvenSense(TDK), Bosch Sensortec, STMicroelectronics, Senodia Technologies, Analog Devices, Aceinna, Adafruit, Honeywell, M5Stack, MEMSIC, Murata, EPSON, QST Corporation, Panasonic Industry] these players have adopted various strategies to increase their market penetration and strengthen their position in the industry. Stake holders and other participants in the global 6-Axis IMU market will be able to gain the upper hand by using the report as a powerful resource for their business needs.\nNumber of Tables and Figures : 134\nWhat is the 6-Axis IMU market growth?\n6-Axis IMU Market Size is projected to Reach Multimillion USD by 2030, In comparison to 2023, at unexpected CAGR during the forecast Period 2023-2030.\n#IMU #sensors #autonomousfuture #ADAS\n\nread the article here https://lnkd.in/gHpN5XRH"}, {"id": "activity:7052631380454735872", "urn": "urn:li:activity:7052631380454735872", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7052631380454735872", "author": "ACEINNA", "timeFormatted": "2mo", "content": {"type": "image", "source": null, "title": null, "thumbnail": {"width": 800, "height": 450, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-af26c54e7a.jpeg"}}, "text": "Are you involved in developing next generation autonomous vehicles annd/or ADAS systems?\n\nCheck out this news from Aceinna. New high performance IMU -\n\nhttps://lnkd.in/gbTe_hvd\n\nThis high accuracy and low latency IMU (1 degrees per hour bias instability and 0.1 degrees per square root hour angular random walk) provides precise localization and safety.\n\nDesigned for developers of autonomous vehicles, self-driving taxis & delivery vehicles, as well as for ADAS systems\n \nASIL-B Certified, 6DOF IMU with Ethernet and CAN-FD Interface\n\nACEINNA Inc. (pronounced “A See Nah”), today announced the general availability of the IMU330RA high performance inertial measurement unit (IMU). ACEINNA’s new IMU330RA is an easy-to-integrate, high-performance 6-DOF inertial sensor packaged in a ruggedized, sealed over-molded plastic housing at IP69K level. The IMU330RA features a redundant 3-Axis Accelerometer and 3-Axis Rate Gyroscope sensors for excellent accuracy and reliability.\n\nThe module supports both 1000Base-T1 Automotive Ethernet and CAN-FD interfaces and provides up to 1000Hz update rate with low latency. The IMU330RA is an automotive grade, ASIL B certified device which serves as the basis for customer positioning system integration to ASIL D.\n\n“Our new ACEINNA IMU330RA IMU sensor is designed for use in Automotive Level 3 and higher ADAS systems,” says Teoman Ustun, VP of ACEINNA’s Automotive Business Unit. “This new sensor module provides encrypted data, at up to 1000Hz output rate over both Ethernet and CAN-FD interfaces, and supports precise synchronization based on gPTP 802.1AS:2020 and Unified Diagnostic Services.”\n\nCritical features include:\n1 degrees per hour bias instability and 0.1 degrees per square root hour angular random walk\n1000Base-T1 Automotive Ethernet and CAN-FD interfaces\nSupports gPtP 802.1AS:2020 time synchronization over Ethernet as a gPtP slave\nSupports UDS (Unified Diagnostic Services), as defined in ISO 14229-1 and 14229-5 over Ethernet and CAN\nAutomotive Grade with AEC Q-104 fulfillment\nPart Operating Temperature Grade 2: -40C to +105C\nIP69K, rugged, sealed, over-molded packaging\nEncrypted software updates and communication, with on board hardware security module (HSM)\nLevel B Automotive Safety Integration\n#autonomousfuture #automotive #selfdrivingcars #precisepositioning #IMU #safety #autonomousvehicles #ASILB #localization #localizationservice \n \nAdditional technical details and specifications about the new IMU330RA is available at https://lnkd.in/g5WpyKaU"}, {"id": "activity:7048639481909841920", "urn": "urn:li:activity:7048639481909841920", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7048639481909841920", "author": "ACEINNA", "timeFormatted": "2mo", "content": {"type": "article", "source": "https://www.wired.com/story/zoox-robotaxi-sound-design/", "title": "Robotaxis Are Going to Sound Weird", "thumbnail": {"width": 800, "height": 419, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-35dd8aa5fc.jpeg"}}, "text": "Why are Robotaxis Going to Sound Weird?\n\nGood weird! Skip the small talk in a driverless EV and enjoy the audio cues that will guide you through a ride and keep you safe.\n\nRead the entire article at Wired - https://lnkd.in/gTukzCbw\n\n\nRobotaxis have to use a whole suite of noises to guide a rider through the journey and keep them from doing anything stupid along the way. Most of it is standard car stuff: sounds to let you know a door is ajar, sounds to tell you to put your seat belt on, sounds to alert you that the route has changed. The challenge is making the bleeps and bloops communicate as clearly as a human would.\n\nZoox has designed a whole suite of sounds for its vehicles. The resulting audio palette sounds like the synthy soundtrack to an '80s movie that’s been sliced into tiny bits. The car's interior aura is a slow ambient hum, like something you’d hear on the chill-out radio station Hearts of Space. The idea is to make the experience of being a passenger feel peaceful. \n\n#Robotaxi #automotiveindustry #autonomousfuture #autonomousvehicles #robotics #Inertialnavigationsystem #imu "}, {"id": "activity:7048415849044443136", "urn": "urn:li:activity:7048415849044443136", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7048415849044443136", "author": "ACEINNA", "timeFormatted": "2mo", "content": {"type": "article", "source": "https://www.eetimes.com/avs-see-the-future-with-perception-sensors/", "title": "Autonomous Driving ‘Sees’ the Future - EE Times", "thumbnail": {"width": 800, "height": 800, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-58fb5a44b7.jpeg"}}, "text": "Autonomous Vehicles- What is the future of percption sensors\n\nWhat is the Future of Perception Sensors for Autonmous Vehciles?\n\nAutonomous driving has moved from hype to reality, and it might be some time before autonomous vehicles (AVs) allow their passengers to watch a movie or admire the scenery while driving them safely to their destination. In this blurry picture, camera, radar and LiDAR units are the “eyes” of the vehicles, mapping the road to full autonomy.\n\nTo gain an objective view of the present situation and prospects, EE Times consulted Pierrick Boulay, senior technology and market analyst in the Photonics and Sensing Division at Yole Intelligence, part of Yole Group. Pierre Cambou, principal analyst in the Photonics and Sensing Division at Yole Intelligence, also contributed to the analysis.\n\nYole Intelligence’s Pierrick Boulay\n“It is clear that the automotive industry has underestimated how difficult it would be to develop autonomous driving features,” Boulay said. “Ten years ago, the industry expected that autonomous driving would be more common. It was one of Tesla’s promises, and if we look at where we are today, Tesla has still not achieved full autonomous driving features.”\n\nThe only automated features have been implemented by European and Japanese OEMs, and these features are still limited to highways, with driving speeds up to 60 km/h, Boulay said. “It is almost a useless feature and quite far from what people expected 10 years ago.”\n\nRead the entire article here https://lnkd.in/gRxNCy86\n\n#tesla #automotiveindustry #Perceptionsensors #IMU #INS #autonomousfuture #future #autonomousvehicles #selfdrivingcars "}, {"id": "activity:7047568226729283584", "urn": "urn:li:activity:7047568226729283584", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7047568226729283584", "author": "ACEINNA", "timeFormatted": "3mo", "content": {"type": "article", "source": "https://eepower.com/technical-articles/beware-of-these-electric-vehicle-charging-challenges/#", "title": "Beware of These Electric Vehicle Charging Challenges - Technical Articles", "thumbnail": {"width": 800, "height": 400, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-3eb45f690f.jpeg"}}, "text": "What are the top Electric Vehicle Charging Challenges?\n\nThe batteries and charging systems associated with electric vehicles play a crucial role in determining the efficiency and cost of these vehicles. This article discusses the potential challenges of wired and wireless electric vehicle charging methods.\n\nRead the article here - https://lnkd.in/gZm35x9z\n\n#electricvehicles #batteries #electricvehicle #evcharginginfrastructure #IEC #currentsensor "}, {"id": "activity:7046466984850436097", "urn": "urn:li:activity:7046466984850436097", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7046466984850436097", "author": "ACEINNA", "timeFormatted": "3mo", "content": {"type": "article", "source": "https://www.nationalworld.com/lifestyle/cars/99-of-drivers-overestimate-how-often-evs-run-out-of-charge-3376560", "title": "99% of drivers overestimate how often EVs run out of charge", "thumbnail": {"width": 800, "height": 448, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-3d5624a120.jpeg"}}, "text": "Why do 99% of drivers overestimate how often EVs run out of charge?\n\nAA finds huge misconceptions around how many EVs break down through running battery flat\n\nAccording to its records less than four per cent of EV breakdowns it attended last year were for cars with a flat drive battery.\n\nread the article here https://lnkd.in/e6A72fsk\n\n#electriccars #EVs #evcharginginfrastructure #automotive #currentsensor "}, {"id": "activity:7046125826374828033", "urn": "urn:li:activity:7046125826374828033", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7046125826374828033", "author": "ACEINNA", "timeFormatted": "3mo", "content": {"type": "article", "source": "https://www.eetimes.eu/battery-charging-and-evs-automakers-need-a-startup-mindset", "title": "Battery Charging and EVs: Automakers Need a Startup Mindset", "thumbnail": {"width": 800, "height": 521, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-1152209080.jpeg"}}, "text": "Is enough being done to accelerate EV adoption, given national targets to go electric?\n\nBattery Charging and EVs: Automakers Need a Startup Mindset\n\nRead the entire artice here https://lnkd.in/gcMs-bqC\n\n#startup #infrastructure #transportation #evcharginginfrastructure  #electriccars #batteries #electricvehicles #currentsensor \n\nNow that carmakers have done a reality check on expectations for the rollout of autonomous vehicles, their attention seems to have turned to battery-charging technologies and charging infrastructure for electric vehicles. Is enough being done to accelerate EV adoption, given national targets to go electric?\n\nSome of the carmakers definitely think they are chasing their own tail. This week, Ford’s managing director for the U.K. and Ireland, Lisa Brankin, told the Financial Times that switching to 100% electric vehicles requires a wealth of public charging infrastructure but that (in the U.K.), there doesn’t appear to be a plan in place to allow that to happen. This comes as globally, Ford reported financial results yesterday that showed its Ford Model e business, the name it has given to its EV unit, expects a full-year loss of about $3 billion this year.\n\nIn another announcement, Renault is said to be in talks with Nissan about synergies in EV charging in 11 European countries. According to Reuters, Renault’s charging unit CEO, Nicolas Schottey, said they are in talks already about adding charging boxes that customers in France can have installed at home for their Nissan EV to be supplied by the Mobilize unit of its partner Renault.\n\nAt least the U.S. government has started taking EV charging seriously. The Biden–Harris administration last week opened applications for a new multi-billion–dollar program to fund EV charging and alternative-fueling infrastructure in communities across the country and along designated highways, interstates and major roadways. The U.S. Federal Highway Administration said this is a key step toward the president’s goals of building a national network of 500,000 public EV charging stations and reducing national greenhouse gas emissions by 50% to 52% by 2030.\n\nThis is part of the U.S. Department of Transportation’s Charging and Fueling Infrastructure (CFI) Discretionary Grant Program, established by the Bipartisan Infrastructure Law, to provide $2.5 billion over five years to a wide range of applicants, including cities, counties, local governments and tribes. This round of funding makes up to $700 million funding from fiscal years 2022 and 2023 available to strategically deploy EV charging and other alternative vehicle-fueling infrastructure projects in publicly accessible locations in urban and rural communities, as well as along designated alternative fuel corridors."}, {"id": "activity:7044316494352052224", "urn": "urn:li:activity:7044316494352052224", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7044316494352052224", "author": "ACEINNA", "timeFormatted": "3mo", "content": {"type": "article", "source": "https://insights.globalspec.com/article/20107/when-will-electric-vehicles-outnumber-ices", "title": "When will electric vehicles outnumber ICEs?", "thumbnail": {"width": 752, "height": 423, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-24935802d8.jpeg"}}, "text": "Are you ownderign when will electric vehicles outnumber ICEs?\n\nWhile the internal combustion engine (ICE) is still king of the road, sales of these vehicles peaked in 2017, according to a report by industry analysts at Bloomberg New Energy Finance. Since then, as sales of electrified vehicles — electric vehicles (EVs) and hybrids (mild, plugin, and hybrid vehicles) — have increased, the demand for fossil-fueled transport has been in permanent decline.\n\nWhat is more, sales of EVs are expected to triple from the current levels by 2025. And with legislation set to add further impetus to electrification, manufacturers, governments, analysts and the public are asking: When will EVs and hybrids outnumber combustion vehicles?\n\nThis a simple question that unfortunately has no simple answer.\nThe time it takes for EVs to overtake ICEs in the sales race will be significantly shorter than the time it will take for EVs to dominate the roads. To complicate matters even further, there are differing definitions of what constitutes an EV, and of course, the phase-out of ICEs will not happen simultaneously across the globe.\n\nRead the G;obalSpec article here https://lnkd.in/g6KAAMCu\n\n#electricvehicles #evcharginginfrastructure #energy #automotiveindustry #phev #hev #bevs #currentsensor #imu #ADAS"}, {"id": "activity:7043960614284652544", "urn": "urn:li:activity:7043960614284652544", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7043960614284652544", "author": "ACEINNA", "timeFormatted": "3mo", "content": {"type": "article", "source": "https://aceinna.isolvedhire.com/jobs/824849-305633.html", "title": "Hardware Development Test Engineer - Tewksbury, MA", "thumbnail": {"width": 200, "height": 200, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-c9be94a9c1.jpeg"}}, "text": "ACEINNA is looking for a Hardware Development Test Engineer\n\nThe Hardware Development Test Engineer will work closely with the ASIC and sensor design teams throughout the product development cycle. This engineer will have ownership over a wide variety of testing, characterization, and debugging responsibilities for Aceinna's early-stage prototypes.\n\nWhat you'll be doing\nDesigning schematics and layouts for analog/mixed signal printed circuit boards (PCB)\nDevelop Automated Test Equipment (ATE) programs for product characterization and test\nCollect and analyzeASIC and sensor data\nManage and maintain equipment in a hardware R&D laboratory\nCollaborate with design engineers to troubleshoot and fix product issues\nSupport customers with engineering samples and issues\nInterface with module design, production, and quality teams to transition products into volume production\n\n#MEMS #sensor #engineerjobs #HardwareDevelopment #engineering #work #hardware #engineers #testing \n\nMore details here - https://lnkd.in/g-sByApY"}, {"id": "activity:7043933415968034816", "urn": "urn:li:activity:7043933415968034816", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7043933415968034816", "author": "ACEINNA", "timeFormatted": "3mo", "content": {"type": "article", "source": "https://www.electronicdesign.com/technologies/power/article/21262259/microwaves-rf-highpower-current-sensors-primed-for-automotive-industrial-power-apps", "title": "High-Power Current Sensors Primed for Automotive, Industrial Power Apps", "thumbnail": {"width": 800, "height": 420, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-9d04cba1c4.jpeg"}}, "text": "APEC News - High-Power Current Sensors Primed for Automotive, Industrial Power Apps\n\n1.5-MHz current sensors support fast-switching SiC and GaN power stages in data centers, motor drives and inverters, and EV batteries and charging infrastructure.\n\nIn its Booth #863 at APEC 2023, ACEINNA is unveiling its latest high-power current-sensing devices. The company’s MCx2101 (AEC-Q100 qualified automotive) and MCx1101 (industrial) isolated AMR current sensors are said to maximize the benefits of using SiC/GaN and help further increase the overall power-conversion efficiency while improving the safety thanks to their industry-leading high accuracy, high bandwidth, and fast response time.\n\nRead the entire article here at Electorninc Design Magazine https://lnkd.in/g_sfEz5V\n\n#currentsensor #SiC #GaN #automotiveindustry #evcharginginfrastructure #inverter #power #automotive #apec2023 "}, {"id": "activity:7043592645423595520", "urn": "urn:li:activity:7043592645423595520", "permalink": "https://www.linkedin.com/feed/update/urn:li:activity:7043592645423595520", "author": "ACEINNA", "timeFormatted": "3mo", "content": {"type": "article", "source": "https://www.powerelectronicsnews.com/why-do-we-need-ev-fast-charging-stations", "title": "EV fast charging stations. Power Electronics News.", "thumbnail": {"width": 800, "height": 450, "url": "https://news.platformio.org/liupdates/aceinna/thumbnail-fc92e7e83f.jpeg"}}, "text": "Why do we need EV fast charging stations?\n\nRead the entire article at Power Electronics News https://lnkd.in/gXbugNtV\n\n\nThis article explores the need for faster electric vehicle charging stations and the financial investments required to improve power infrastructure.\n\nDespite the increasing number of electric vehicle (EV) manufacturers and government incentives, the adoption of electric vehicles has not yet skyrocketed. One reason for this may be the longer charging time compared to filling up a traditional car with gasoline. However, experts believe that advancements in fast charging technology with improved sustainability and lower costs will be a major driver for the proliferation of EV fast charging stations, which in turn will drive the growth of the electric vehicle market. As a result, there is a lot of research and development happening in this field, with various companies and organizations introducing their own fast charging methods, some of which can charge a vehicle in as little as 10 minutes.\n\n#evcharginginfrastructure #electricvehicles #electricvehiclecharging #power #technology #currentsensor"}]